(function(){
// ----------------------------------------------------------
// アンカーリンクの移動をスクロールにする
// ----------------------------------------------------------


// ----------------------------------------------------------
// 変数の記述ルール
// var EXAMPLE   = 全て大文字の変数は定数
// var _example = アンダースコアから始まる変数は関数内だけで有効な変数
// var i_example = i_から始まる変数は引数
// var $example = $から始まる変数はjQueryオブジェクト
// var _$example = _$から始まる変数は関数内だけで有効なjQueryオブジェクト
// ----------------------------------------------------------

//-----------------------------------------------------------
// 最上位の変数(無名関数でスコープされていますので、グローバル変数ではありません)
//-----------------------------------------------------------

    var _classname_active = 'is-show-content';
    var _trigger_obj_class = '.js-show-trigger';

//-----------------------------------------------------------
// 関数を定義 | 連想配列を定義
//-----------------------------------------------------------


//-----------------------------------------------------------
// 処理を実行
//-----------------------------------------------------------
$(function(){

    $(_trigger_obj_class).on('click',function(){
        $(this).toggleClass(_classname_active);
    });

});

})();